leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxSmu_bf.h
/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF22 */
#define IFX_SMU_RMEF_EF22_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF22 */
#define IFX_SMU_RMEF_EF22_OFF (22u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF23 */
#define IFX_SMU_RMEF_EF23_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF23 */
#define IFX_SMU_RMEF_EF23_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF23 */
#define IFX_SMU_RMEF_EF23_OFF (23u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF24 */
#define IFX_SMU_RMEF_EF24_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF24 */
#define IFX_SMU_RMEF_EF24_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF24 */
#define IFX_SMU_RMEF_EF24_OFF (24u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF25 */
#define IFX_SMU_RMEF_EF25_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF25 */
#define IFX_SMU_RMEF_EF25_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF25 */
#define IFX_SMU_RMEF_EF25_OFF (25u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF26 */
#define IFX_SMU_RMEF_EF26_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF26 */
#define IFX_SMU_RMEF_EF26_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF26 */
#define IFX_SMU_RMEF_EF26_OFF (26u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF27 */
#define IFX_SMU_RMEF_EF27_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF27 */
#define IFX_SMU_RMEF_EF27_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF27 */
#define IFX_SMU_RMEF_EF27_OFF (27u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF28 */
#define IFX_SMU_RMEF_EF28_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF28 */
#define IFX_SMU_RMEF_EF28_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF28 */
#define IFX_SMU_RMEF_EF28_OFF (28u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF29 */
#define IFX_SMU_RMEF_EF29_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF29 */
#define IFX_SMU_RMEF_EF29_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF29 */
#define IFX_SMU_RMEF_EF29_OFF (29u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF2 */
#define IFX_SMU_RMEF_EF2_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF2 */
#define IFX_SMU_RMEF_EF2_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF2 */
#define IFX_SMU_RMEF_EF2_OFF (2u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF30 */
#define IFX_SMU_RMEF_EF30_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF30 */
#define IFX_SMU_RMEF_EF30_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF30 */
#define IFX_SMU_RMEF_EF30_OFF (30u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF31 */
#define IFX_SMU_RMEF_EF31_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF31 */
#define IFX_SMU_RMEF_EF31_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF31 */
#define IFX_SMU_RMEF_EF31_OFF (31u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF3 */
#define IFX_SMU_RMEF_EF3_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF3 */
#define IFX_SMU_RMEF_EF3_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF3 */
#define IFX_SMU_RMEF_EF3_OFF (3u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF4 */
#define IFX_SMU_RMEF_EF4_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF4 */
#define IFX_SMU_RMEF_EF4_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF4 */
#define IFX_SMU_RMEF_EF4_OFF (4u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF5 */
#define IFX_SMU_RMEF_EF5_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF5 */
#define IFX_SMU_RMEF_EF5_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF5 */
#define IFX_SMU_RMEF_EF5_OFF (5u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF6 */
#define IFX_SMU_RMEF_EF6_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF6 */
#define IFX_SMU_RMEF_EF6_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF6 */
#define IFX_SMU_RMEF_EF6_OFF (6u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF7 */
#define IFX_SMU_RMEF_EF7_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF7 */
#define IFX_SMU_RMEF_EF7_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF7 */
#define IFX_SMU_RMEF_EF7_OFF (7u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF8 */
#define IFX_SMU_RMEF_EF8_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF8 */
#define IFX_SMU_RMEF_EF8_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF8 */
#define IFX_SMU_RMEF_EF8_OFF (8u)

/** \brief  Length for Ifx_SMU_RMEF_Bits.EF9 */
#define IFX_SMU_RMEF_EF9_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMEF_Bits.EF9 */
#define IFX_SMU_RMEF_EF9_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMEF_Bits.EF9 */
#define IFX_SMU_RMEF_EF9_OFF (9u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS0 */
#define IFX_SMU_RMSTS_STS0_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS0 */
#define IFX_SMU_RMSTS_STS0_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS0 */
#define IFX_SMU_RMSTS_STS0_OFF (0u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS10 */
#define IFX_SMU_RMSTS_STS10_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS10 */
#define IFX_SMU_RMSTS_STS10_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS10 */
#define IFX_SMU_RMSTS_STS10_OFF (10u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS11 */
#define IFX_SMU_RMSTS_STS11_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS11 */
#define IFX_SMU_RMSTS_STS11_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS11 */
#define IFX_SMU_RMSTS_STS11_OFF (11u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS12 */
#define IFX_SMU_RMSTS_STS12_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS12 */
#define IFX_SMU_RMSTS_STS12_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS12 */
#define IFX_SMU_RMSTS_STS12_OFF (12u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS13 */
#define IFX_SMU_RMSTS_STS13_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS13 */
#define IFX_SMU_RMSTS_STS13_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS13 */
#define IFX_SMU_RMSTS_STS13_OFF (13u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS14 */
#define IFX_SMU_RMSTS_STS14_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS14 */
#define IFX_SMU_RMSTS_STS14_MSK (0x1u)

/** \brief  Offset for Ifx_SMU_RMSTS_Bits.STS14 */
#define IFX_SMU_RMSTS_STS14_OFF (14u)

/** \brief  Length for Ifx_SMU_RMSTS_Bits.STS15 */
#define IFX_SMU_RMSTS_STS15_LEN (1u)

/** \brief  Mask for Ifx_SMU_RMSTS_Bits.STS15 */
#define IFX_SMU_RMSTS_STS15_MSK (0x1u)

